brew 'bat'
brew 'fzf'
brew 'git'
brew 'lazygit'
brew 'mas'
brew 'neovim'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'tmux'

tap 'homebrew/cask-drivers'

cask '1password'
# cask 'alfred3'
cask 'alfred'
# cask 'corsair-icue'
cask 'cyberduck'
cask 'discord'
cask 'dropbox'
cask 'fantastical'
cask 'google-chrome'
cask 'iterm2'
cask 'karabiner-elements'
cask 'logitech-g-hub'
# cask 'razer-synapse'
cask 'sizeup'
cask 'shureplus-motiv'
cask 'spotify'
# cask 'steam'
cask 'ubiquiti-unifi-controller'
cask 'whatsapp'

# Work
cask 'docker'
cask 'postman'
cask 'slack'
# cask 'sourcetree'
cask 'tableplus'
cask 'tuple'
cask 'visual-studio-code'
cask 'wireguard-tools'

# mas 'bear', id: 1091189122
# mas 'microsoft-remote-desktop', id: 1295203466
mas 'spark', id: 1176895641
mas 'todoist', id: 585829637
