brew 'fzf'
brew 'git'
brew 'lazygit'
brew 'mas'
brew 'neovim'
brew 'reattach-to-user-namespace'
brew 'ripgrep'
brew 'tmux'

tap 'homebrew/cask-drivers'

cask '1password'
cask 'alfred3'
# cask 'corsair-icue'
cask 'discord'
cask 'fantastical'
cask 'google-chrome'
cask 'iterm2'
cask 'logitech-g-hub'
# cask 'razer-synapse'
cask 'sizeup'
cask 'spotify'
cask 'whatsapp'

# Work
cask 'docker'
cask 'postman'
cask 'slack'
cask 'sourcetree'
cask 'tableplus'
cask 'tuple'


mas 'spark', id: 1176895641
mas 'todoist', id: 585829637
